---
kind: property
id: P:Autodesk.Revit.DB.WallType.Function
source: html/db0e9ef1-89cf-fcd2-081e-386d536dc91f.htm
---
# Autodesk.Revit.DB.WallType.Function Property

The wall function.

## Syntax (C#)
```csharp
public WallFunction Function { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: A value passed for an enumeration argument is not a member of that enumeration